tutorials/compressible/rhoCfdemSolverPimple/settlingTestMPI/CFD/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{

    wall
    {
        type            zeroGradient;
        value           $internalField;
    }

    inlet
    {
        type            zeroGradient;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
